In [1]:
import pandas as pd
best_actors_df = pd.DataFrame({
    "Best Actors":["Nic Cage","Nic Cage","Harrison Ford"]
})
best_actors_df

     Best Actors
0       Nic Cage
1       Nic Cage
2  Harrison Ford

In [4]:
# To indicate duplicated entries, Pandas marks the first entry as False and any copies as True.
best_actors_df.duplicated()

0    False
1     True
2    False
dtype: bool

In [5]:
# This produces the number 1, because only one duplicated value exists
best_actors_df.duplicated().sum()

1

In [6]:
# Drop any duplicates
best_actors_df = best_actors_df.drop_duplicates()
best_actors_df

     Best Actors
0       Nic Cage
2  Harrison Ford

In [8]:
import pandas as pd

prices = pd.DataFrame({
    "price_usd":["$0.53","$0.22","0.34"]
})
prices

  price_usd
0     $0.53
1     $0.22
2      0.34

In [9]:
prices.dtypes

price_usd    object
dtype: object

In [10]:
# replace the dollar sign with empty strings
prices.loc[:,"price_usd"] = prices.loc[:,"price_usd"].str.replace("$","")
prices

C:\Users\joset\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.

  price_usd
0      0.53
1      0.22
2      0.34

In [11]:
prices.dtypes

price_usd    object
dtype: object

In [13]:
# Convert prices to float
prices.loc[:,"price_usd"] = prices.loc[:,"price_usd"].astype("float")
prices.dtypes

price_usd     float64
prices_usd    float64
dtype: object

In [2]:
import pandas as pd

sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})
sales_df.head()

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
2   potatoes        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [3]:
sales_df.describe()

        quantity  total_price
count   5.000000     5.000000
mean   13.000000    37.688000
std     8.717798    17.128761
min     2.000000     8.460000
25%    10.000000    39.520000
50%    12.000000    40.200000
75%    15.000000    50.010000
max    26.000000    50.250000

In [4]:
goog_df = pd.DataFrame({"AAPL": [1045.85, 1070.08, 1140.99, 1113.65, 1193.32, 1231.54, 1215.00, 1207.15,1248.84, 1166.27, 1138.85, 1003.63, 1080.91]})

goog_df

       AAPL
0   1045.85
1   1070.08
2   1140.99
3   1113.65
4   1193.32
5   1231.54
6   1215.00
7   1207.15
8   1248.84
9   1166.27
10  1138.85
11  1003.63
12  1080.91

In [5]:
goog_df.describe()

              AAPL
count    13.000000
mean   1142.775385
std      76.556568
min    1003.630000
25%    1080.910000
50%    1140.990000
75%    1207.150000
max    1248.840000

In [6]:
sales_df.mean()

C:\Users\joset\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

quantity       13.000
total_price    37.688
dtype: float64

In [8]:
sales_df.max()

item           tomatoes
quantity             26
total_price       50.25
dtype: object

In [9]:
min_price = sales_df["total_price"].min()
min_price

8.46

In [18]:
import pandas as pd

# Create a DataFrame
aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1]})

# Select the first row using iloc
aapl_returns.iloc[0]

AAPL    0.5
Name: 0, dtype: float64

In [19]:
aapl_returns

   AAPL
0  0.50
1  0.56
2  0.59
3  0.52
4  0.10

In [20]:
aapl_returns.iloc[0:3]

   AAPL
0  0.50
1  0.56
2  0.59

In [1]:
import pandas as pd

aapl_returns = pd.DataFrame({"AAPL":[0.5,0.56,0.59,0.52,0.1,0.75,0.47]})

aapl_returns.iloc[4:]

   AAPL
4  0.10
5  0.75
6  0.47

In [2]:
aapl_returns.iloc[-3]

AAPL    0.1
Name: 4, dtype: float64

In [4]:
aapl_returns.iloc[-3:]

   AAPL
4  0.10
5  0.75
6  0.47

In [10]:
import numpy as np

revenue_df = pd.DataFrame(
    np.random.randint(low=1, high=1000, size=1000),
    index=pd.date_range('1/1/2017',periods=1000),
    columns=['revenue'])
revenue_df.tail()

            revenue
2019-09-23       49
2019-09-24      856
2019-09-25      484
2019-09-26      611
2019-09-27      772

In [11]:
# Select the last quarter of 2018 to the first quarter of 2019
revenue_df.loc['2018-10-01':'2019-03-31']

            revenue
2018-10-01      654
2018-10-02      842
2018-10-03      671
2018-10-04      117
2018-10-05      659
...             ...
2019-03-27      807
2019-03-28      679
2019-03-29      900
2019-03-30      129
2019-03-31      920

[182 rows x 1 columns]

In [12]:
# Describe the data by using summary statistics
revenue_df.loc['2018-10-01':'2019-03-31'].describe()

          revenue
count  182.000000
mean   526.148352
std    297.031120
min     11.000000
25%    268.000000
50%    537.000000
75%    799.750000
max    997.000000

In [13]:
import pandas as pd

sales_df = pd.DataFrame({"item":["tomatoes","onions","potatoes","tomatoes","mushrooms"],
                        "quantity":[15, 26, 10, 12, 2],
                        "total_price": [50.25,39.52,50.01,40.20,8.46]})
sales_df.head()

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
2   potatoes        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [14]:
# Filter by quantity greater than 10 
sales_df["quantity"]>10

0     True
1     True
2    False
3     True
4    False
Name: quantity, dtype: bool

In [15]:
filter = sales_df["quantity"]>10
sales_df.loc[filter]

# We can also write the code in a single line sales_df.loc[sales_df['quantity']>10]

       item  quantity  total_price
0  tomatoes        15        50.25
1    onions        26        39.52
3  tomatoes        12        40.20

In [16]:
import pandas as pd

sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})
sales_df.head()

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
2   potatoes        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [19]:
# Shows rows with quantity greater than 10 AND total price less than 45
sales_df.loc[(sales_df['quantity']>10) & (sales_df['total_price']<45)]

       item  quantity  total_price
1    onions        26        39.52
3  tomatoes        12        40.20

In [20]:
# Shows rows where quantity is greater than 10 or total price is less than 45
sales_df.loc[(sales_df['quantity']>10) | (sales_df['total_price']<45)]

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [26]:
# Find the minimum price
min_price = sales_df['total_price'].min()
# Find the row with the minimum price
min_price_row = sales_df.loc[sales_df['total_price']==min_price]
# print minimum price row
min_price_row

        item  quantity  total_price
4  mushrooms         2         8.46

In [27]:
max_price = sales_df['total_price'].max()
max_price_row = sales_df.loc[sales_df['total_price'] == max_price] 
max_price_row

       item  quantity  total_price
0  tomatoes        15        50.25

In [25]:
# Find the mean price of tomatoes
sales_df.loc[sales_df['item'] == 'tomatoes',['total_price']].mean()

total_price    45.225
dtype: float64

In [28]:
# To select columns, use loc[rows,columns] or iloc[rows,columns]
sales_df.iloc[0:3,[0,2]]

       item  total_price
0  tomatoes        50.25
1    onions        39.52
2  potatoes        50.01

In [30]:
# For the loc function, filter by using column values
sales_df.loc[sales_df['item']=='tomatoes',['quantity','total_price']]

   quantity  total_price
0        15        50.25
3        12        40.20

In [31]:
# Filter columns without filtering for rows
sales_df.loc[:,['item','total_price']]

        item  total_price
0   tomatoes        50.25
1     onions        39.52
2   potatoes        50.01
3   tomatoes        40.20
4  mushrooms         8.46

In [32]:
# To sort values, use the sort_values function
sales_df.sort_values('total_price')

        item  quantity  total_price
4  mushrooms         2         8.46
1     onions        26        39.52
3   tomatoes        12        40.20
2   potatoes        10        50.01
0   tomatoes        15        50.25

In [33]:
# To sort in descending order, use ascending=False
sales_df.sort_values('total_price',ascending=False)

        item  quantity  total_price
0   tomatoes        15        50.25
2   potatoes        10        50.01
3   tomatoes        12        40.20
1     onions        26        39.52
4  mushrooms         2         8.46

In [34]:
# To sort by multiple columns, pass a list of column names
sales_df.sort_values(['total_price','item'],ascending=False)

        item  quantity  total_price
0   tomatoes        15        50.25
2   potatoes        10        50.01
3   tomatoes        12        40.20
1     onions        26        39.52
4  mushrooms         2         8.46